errorcode = {
    1101 : "이메일을 입력하세요",
    1102 : "이름을 입력하세요",
    1103 : "비밀번호를 입력하세요",
    1104 : "올바른 이메일 형식이 아닙니다.",
    1105 : "비밀번호는 8자 이상이어야 합니다.",
    1106 : "최소 1글자 이상의 소문자를 포함 해야합니다.",
    1107 : "최소 1글자 이상의 대문자를 포함 해야합니다.",
    1108 : "최소 1글자 이상의 특수문자를 포함 해야합니다.",
    1109 : "비밀번호가 맞지 않습니다.",
    1110 : "잘못된 email 또는 비밀번호입니다.",
    1111 : "권한이 없습니다.",


    1200 : "DB commit 에러",
    1201 : "이미 사용된 아이디 입니다.",
    1202 : "존재 하지 않은 아이디 입니다.",

    1301 : "access token이 만료되었습니다.",
    1302 : "유효하지 않은 token 타입 입니다.",
    1303 : "유효하지 않은 token 입니다.",
    1304 : "token 이 만료 되었습니다. 다시 로그인 해주세요",
    1305 : "Authorization head missing",

    1401 : "게시글이 없습니다.",
    1402 : "게시글 제목을 1 ~ 100자로 작성해주세요",
    1403 : "찾을 수 없는 게시글 입니다.",
    1404 : "본 게시글은 작성자만 수정 및 삭제가 가능합니다."

}